import { HttpClient } from '@angular/common/http';
import { Injectable } from '@angular/core';


/*
  Generated class for the FoodProvider provider.

  See https://angular.io/guide/dependency-injection for more info on providers
  and Angular DI.
*/
@Injectable()
export class FoodProvider {
  foodlist: any;
  fastfoodlist:any;
  drinklist:any;
  desertlist:any;
constructor(public http: HttpClient) 
{
  this.foodlist=[
    {
      id: 1,
      name: "ต้มยำรวมมิตร",
      detail: "ส่วนผสม กุ้งกุลาดำตัวใหญ่ หรือกุ้งแม่น้ำ เห็ดฟางผ่าครึ่ง พริกขี้หนู ใบมะกรูดฉีกเอาก้านออก ข่าหั่นแว่น ตะไคร้ทุบแล้วหั่นท่อน ผักชี โรยหน้า น้ำพริกเผา 1 ช้อนชา มะนาว 1 ลูก กะทิหรือนมข้นจืด 1/2 ถ้วย น้ำตาล 1/2 ช้อนโต๊ะ น้ำปลา 1 ช้อนโต๊ะ เกลือ 1 หยิบมือ น้ำซุป (ถ้าไม่มีเป็นซุปสำเร็จรูปกับน้ำเปล่า)ขั้นตอนการทำ ก่อนอื่นต้องแกะเปลือกกุ้งผ่าเอาเส้นดำออกล้างให้สะอาด หั่นเครื่องต้มยำ พริก ขิง ข่า ตะไคร้ ใบมะกรูดและเห็ด ให้พร้อม นำน้ำซุปไปตั้งไฟให้เดือด ใส่เครื่องต้มยำลงไปให้หมด พอเดือดอีกครั้งก็ใสกุ้งที่เตรียมไว้ลงไปเลย หลังจากใส่กุ้งลงไปแล้ว ให้ใส่ น้ำตาล น้ำปลา พริกขี้หนู พริกเผา ใครชอบรสแบบไหนใส่ลงไปตามชอบ ตามด้วยเห็ดฟาง ปิดเตาแล้วค่อยปรุงด้วยมะนาว(เคล็ดลับการบีบน้ำมะนาว ไม่ควรใส่มะนาวในน้ำที่กำลังเดือด เพราะจะทำให้มะนาวและน้ำซุปมีรสชม) โรยเกลือนิดหน่อยเพื่อดึงรสเปรี้ยวหวานเค้มให้เข้มข้นมากยิ่งขึ้น จัดชามเสิร์ฟ หั่นผักโรยหน้า เพิ่มความหอม",
      img :"https://food.mthai.com/app/uploads/2016/10/Tomyum.jpg",
      price : "ราคา 120 บาท",
    },
    {
      id: 2,
      name: "ผัดคะน้าปลาเค็ม",
      detail: "ผักคะน้า 2 ต้น ปลาอินทรีเค็ม 1/2 ชิ้น กระเทียมสับ 1 ช้อนโต๊ะ น้ำตาลทราย 1/2 ช้อนชา น้ำมันพืช 2 ช้อนโต๊ะ น้ำสะอาด 3 ช้อนโต๊ะ",
      img :"https://img-global.cpcdn.com/recipes/2f80fc3468b3ce5b/751x532cq70/%E0%B8%A3%E0%B8%B9%E0%B8%9B-%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%81-%E0%B8%82%E0%B8%AD%E0%B8%87-%E0%B8%AA%E0%B8%B9%E0%B8%95%E0%B8%A3-%E0%B8%9C%E0%B8%B1%E0%B8%94%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%84%E0%B8%B0%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B8%9B%E0%B8%A5%E0%B8%B2%E0%B9%80%E0%B8%84%E0%B9%87%E0%B8%A1.jpg",
      price : "ราคา 200 บาท",   
    },
    {
      id: 3,
      name: " แกงจืดเต้าหู้สอดไส้เนื้อปลา",
      detail: "ส่วนผสม แกงจืดเต้าหู้สอดไส้เนื้อปลา เต้าหู้ขาว (แบบนิ่ม) ต้นหอม ผักชี กระเทียม พริกไทย และรากผักชี โขลกละเอียด เนื้อปลาอินทรีบด หรือเนื้อปลากรายบด แตงกวา หรือมะระสด (คว้านเมล็ดออก) น้ำเปล่า ผงซุปไก่ เห็ดหอมหั่น ซีอิ๊วขาว หรือน้ำปลา หรือเกลือป่น แครอท พริกไทยป่น กระเทียมเจียว วิธีทำแกงจืดเต้าหู้สอดไส้เนื้อปลา 1. หั่นแบ่งเต้าหู้ขาวเป็น 4 ชิ้น แล้วผ่าครึ่งเพื่อให้สอดไส้เข้าไปได้ จากนั้นหั่นต้นหอมและผักชีเป็นท่อน พักไว้ 2. โขลกสามเกลอ กระเทียม พริกไทย และรากผักชีให้ละเอียดแล้วนำมาคลุกเคล้ากับเนื้อปลา 3.นำเนื้อปลาที่ปรุงรสยัดไส้ไปในเต้าหู้ และแตงกวา หรือมะระ (ที่สิงคโปร์เขาทำสามแบบ ไส้แตงกวา ไส้มะระ และไส้เต้าหู้) 4. นำหม้อใส่น้ำเปล่าลงไป ตั้งไฟให้เดือด ใส่ผงซุปไก่ลงไป (อาจใส่เห็ดหอมหั่นลงไปต้มด้วย เพื่อให้ได้กลิ่น) 5. เมื่อน้ำเดือดจัด ใส่เต้าหู้และแตงกวายัดไส้ลงไป ปรุงรสด้วยซีอิ๊วขาว ถ้าเต้าหู้และแตงกวาลอยขึ้นมาแสดงว่าสุกดีแล้ว 6. ก่อนปิดไฟให้แบ่งใส่ต้นหอมและผักชีบางส่วนลงไป ใส่แครอทเพื่อเพิ่มสีสัน  7. ก่อนเสิร์ฟ โรยต้นหอม ผักชี และพริกไทย ใส่กระเทียมเจียวลงไป",
      img :"https://img.kapook.com/u/2016/surauch/cOOK/soup1_9.jpg",  
      price : "ราคา 350 บาท", 
    },
    {
      id: 4,
      name: "หมูมะนาว รสเปรี้ยวแซ่บ",
      detail: "ส่วนผสม สันคอหมูหั่นบาง 200 กรัม กระเทียม 10 – 12 หัว พริก เกลือ 1 หยิบมือ น้ำมะนาว 4 ช้อนโต๊ะ น้ำปลา 3 ช้อนโต๊ะ  น้ำตาลทราย 1 1/2 ช้อนโต๊ะ ผักเครื่องเคียง (ก้านคะน้าลวก,กระหล่ำปลีซอย,กระเทียมสด และใบสะระแหน่)",
      img :"https://food.mthai.com/app/uploads/2017/03/Pork-with-Lemon-spicy-sweet-sauce.jpg",
      price : "ราคา 150 บาท",   
    },
    {
      id: 5,
      name: "กุ้งคั่วพริกเกลือ",
      detail: "ส่วนผสม กุ้งคั่วพริกเกลือ กุ้ง กระเทียม (สับหยาบ ๆ) พริกขี้หนูสวน (สับหยาบ ๆ) รากผักชี (สับหยาบ ๆ) เกลือป่น หรือผงรสดี น้ำตาลทราย ต้นหอมซอย (สับหยาบ ๆ)",
      img :"https://s359.kapook.com/pagebuilder/66b3d222-6648-471d-b299-831623d67ad6.jpg",
      price : "ราคา 450 บาท",   
    } 
  ];


  this.fastfoodlist=[
    {
      id: 1,
      name: "ราดหน้าหมู",
      detail: "ส่วนผสม น้ำราดหน้า คะน้า 1-2 ถ้วย กระเทียมสับ 1 ช้อนโต๊ะ เต้าเจี้ยว 2 ช้อนโต๊ะ น้ำเปล่า 1.5 ลิตร ผงปรุงรสหมู (คนอร์) 1 ก้อน น้ำตาลทราย 1 ช้อนโต๊ะ เห็ด ตามชอบ 1-2 ถ้วย แครอต 1 หัว ซีอิ๊วขาว 1-2 ช้อนโต๊ะ พริกไทยป่น 1 ช้อนชา น้ำมันพืช 1-2 ช้อนโต๊ะ แป้งเท้ายายม่อม ผสมน้ำให้ละลาย 3-4 ช้อนโต๊ะ (เปลี่ยนเป็นแป้งมัน หรือแป้งข้าวโพดได้ค่ะ)",
      img :"https://s359.kapook.com/pagebuilder/42ddc9a0-8ea2-4524-88d2-fc70fbe1798c.jpg",
      price : "ราคา 60 บาท",
    },
    {
      id: 2,
      name: "ข้าวมันไก่",
      detail: "ส่วนผสม น้ำต้มไก่ โครงไก่หรือชิ้นส่วนไก่ ผักกาดขาว หรือผักหางหงส์สด 1 หัว (เลือกที่สด ๆ เพื่อให้น้ำหวาน) กระเทียม 3-4 หัว (หรือประมาณ 30 กลีบ) รากผักชี  5–6 ราก ขิงแก่หั่นเป็นแว่นบาง 5–6 แว่น ขิงทุบ เล็กน้อย พริกไทยขาวทุบหยาบ 20–30 เม็ด เกลือสมุทร 1-2 ช้อนโต๊ะ (ถ้าเป็นดอกเกลือจะยิ่งดี ปริมาณเกลือมากน้อยขึ้นอยู่กับปริมาณน้ำ) น้ำตาลกรวด 1/2 ช้อนโต๊ะซีอิ๊วขาว 2–3 ช้อนโต๊ะ น้ำมันพืช 1/2 ช้อนโต๊ะ",
      img :"https://img.kapook.com/u/2015/surauch/Cook/hit1.jpg",
      price : "ราคา 40 บาท",
    },
    {
      id: 3,
      name: "ผัดกระเพราหมูย่าง",
      detail: "พริกขี้หนู พริกหอม กระเทียม น้ำมันพืช 1 ช้อนโต๊ะ หมูย่าง (ซื้อจากร้านส้มตำ) ถั่วฝักยาวหั่นเฉียง ซอสหอยนางรม 1 ช้อนโต๊ะ น้ำตาลทราย 1- 1 1/2 ช้อน ซอสปรุงรส 2 ช้อนชา (หรือน้ำปลา) ใบกะเพรา ข้าวสวย ไข่ดาว",
      img :"https://img.kapook.com/u/2015/surauch/Cook/hit2.jpg",
      price : "ราคา 60 บาท",
    },
    {
      id: 4,
      name: "ข้าวหมูเเดง",
      detail: "ส่วนผสม หมูแดง สันคอหมู หั่นเป็นก้อนตามแนวยาว น้ำมันงา น้ำตาลปี๊บ ซีอิ๊วขาว ซอสหอยนางรม น้ำผึ้ง ผงพะโล้ สีผสมอาหารสีส้ม กระเทียมสับ พริกไทยป่น",
      img :"https://img.kapook.com/u/2015/surauch/Cook/hit6.jpg",
      price : "ราคา 80 บาท",
    }
  ];

  this.drinklist=[
    {
      id: 1,
      name: "น้ำอัญชัญ",
      detail: "วิธีทำน้ำเชื่อม 1. น้ำเปล่า 500 กรัม 3. น้ำตาลทราย 500 กรัม วิธีทำน้ำดอกอัญชัน 1. นำดอกอัญชันสด 100 กรัม ล้างน้ำให้สะอาด ใส่หม้อ เติมน้ำเปล่า 2 ถ้วย ต้มจนเดือด ปิดฝาทิ้งไว้ ประมาณ 2-3 นาที แล้วกรองดอกอัญชันขึ้นจากหม้อต้ม ส่วนผสมน้ำดอกอัญชัน 1. น้ำดอกอัญชัน 1 ถ้วย 2. น้ำเชื่อม 4 ช้อนโต๊ะ 3. น้ำผึ้ง 2 ช้อนโต๊ะ - นำน้ำดอกอัญชัน น้ำเชื่อม และน้ำผึ้งผสมรวมกัน ชิมรสตามชอบ หรืออีกวิธีหนึ่ง นำดอกอัญชันตากแห้งประมาณ 25 ดอก ชงในน้ำเดือด 1 ถ้วย ดื่มแทนชา",
      img :"https://www.ku.ac.th/e-magazine/may49/know/flower.jpg",
      price : "ราคา 60 บาท",
    },
    {
      id: 2,
      name: "น้ำกระเจี๊ยบ",
      detail: "วิธีทำน้ำกระเจี๊ยบ สำหรับส่วนผสมในการทำน้ำกระเจี๊ยบนั้นก็มีเพียงไม่กี่อย่างเท่านั้น โดยจะเน้นดอกกระเจี๊ยบเป็นหลัก ซึ่งก็มีส่วนผสมที่ต้องเตรียมดังนี้ 1. ดอกกระเจี๊ยบแดง 150 กรัม (แบบสดหรือแห้งก็ได้) 2. น้ำ 4 ถ้วย 3. เกลือป่น ½ ช้อนชา 4. น้ำตาลทราย 1 ถ้วย 5. น้ำแข็งก้อนเล็กหรือน้ำแข็งยูนิค 6. กลีบดอกกระเจี๊ยบ (เอาไว้เพื่อตกแต่ง)",
      img :"https://www.coffeefavour.com/wp-content/uploads/2016/06/Image.jpg",
      price : "ราคา 60 บาท",
    },
    {
      id: 3,
      name: "แตงโมมินต์โซดาโฟลท",
      detail: "ส่วนผสม แตงโมมินต์โซดาโฟลท เนื้อแตงโม 2+1/2 ถ้วยตวง ใบสะระแหน่ (สับหยาบ) 12-15 ใบ โซดา (แช่เย็นจัด) 1 ถ้วยตวง ไอศกรีมวานิลลา เนื้อแตงโมหั่นชิ้นเล็ก (สำหรับตกแต่ง) วิธีทำแตงโมมินต์โซดาโฟลท 1. นำเนื้อแตงโม ใบสะระแหน่สับ และโซดาใส่ลงเครื่องปั่น ปั่นผสมจนเนื้อเนียนละเอียด 2. เทใส่แก้วประมาณ 1/2 แก้ว จากนั้นตักไอศกรีมวานิลลาวางลงไปด้านบน โรยเนื้อแตงโมให้สวยงาม พร้อมเสิร์ฟ",
      img :"https://img.kapook.com/u/2017/surauch/cooking/f1_43.jpg",
      price : "ราคา 60 บาท",
    },
    {
      id: 4,
      name: "ม็อกเทลแตงโมขิงโซดา",
      detail: "หลายคนคงเคยดื่มม็อกเทลกันมาบ้างแล้ว แต่เชื่อว่ายังไม่เคยได้ลองม็อกเทลแตงโมขิงโซดาแน่นอน จับเอาแตงโมมาปั่นแล้วเติมน้ำเชื่อมขิงและใส่แตงกวา ที่ขาดไม่ได้เลยคือ โซดาเพิ่มความซาบซ่า ส่วนผสม ม็อกเทลแตงโมขิงโซดา เนื้อแตงโมหั่นเต๋า 4 ถ้วย น้ำตาลทราย 1 ถ้วย น้ำ 1 ถ้วย ขิงสดฝานเป็นแว่น 1 แง่ง ฝักวานิลลา 1 ฝัก (ขูดเมล็ดออก) แตงกวาไร้เม็ด 1 ลูก (สไลซ์เป็นแว่น) โซดา 1 ถ้วย น้ำแข็งบด",
      img :"https://img.kapook.com/u/2017/surauch/cooking/f2_40.jpg",
      price : "ราคา 120 บาท",
    },
  ];


  this.desertlist=[
    {
      id: 1,
      name: "บัวลอย",
      detail: "บัวลอยไข่หวาน สูตรบัวลอยอันดับต้น ๆ ที่นึกถึงเลยคือ บัวลอยไข่หวาน สูตรนี้เนื้อแป้งใส่เผือก ฟักทอง และน้ำใบเตยลงไปด้วยทำให้ได้สีเม็ดบัวลอยจากธรรมชาติ หรือถ้าไม่สะดวกหาวัตถุดิบก็ใช้สีผสมอาหารแทนได้นะคะ บัวลอยเนื้อเหนียวนุ่มเข้ากันดีกับน้ำกะทิหวานหอม ยิ่งถ้ามีไข่หวานเคี้ยวสนุก ๆ ไปพร้อมกันด้วยแล้วละก็ ส่วนผสม บัวลอยไข่หวาน แป้งข้าวเหนียว 1 ถ้วย น้ำเปล่า 1/4 ถ้วย เผือกนึ่งสุก (หรือสีผสมอาหารสีม่วง) ฟักทองนึ่งสุก (หรือสีผสมอาหารเหลือง) น้ำใบเตยคั้นเข้มข้น (หรือสีผสมอาหารสีเขียว) กะทิ 1 ถ้วย น้ำตาลทราย 1 ถ้วย เกลือป่น 1 ช้อนชา ไข่ไก่",
      img :"https://img.kapook.com/u/2017/wanwanat/93_bualoy/loy2_1_1.jpg",
      price : "ราคา 50 บาท",
    },
    {
      id: 2,
      name: "วุ้นกะทิ",
      detail: "อากาศร้อน ๆ แบบนี้ ต้องหาอร่อยเย็น ๆ กระแทกปาก นี่เลย! “วุ้นกะทิอัญชันมะพร้าวอ่อน” สูตรง่าย ๆ ทำเองได้ที่บ้าน สัมผัสกับความเย็นของวุ้น กลิ่นหอมของมะพร้าว สีสันสวย ๆ จากดอกอัญชัน พร้อมด้วยความหอมมันจากวุ้นกะทิ บอกเลยว่าไม่ได้สวยแต่รูปเท่านั้น รสชาติยังอร่อยอีกด้วย ถ้าพร้อมแล้วรีบสวมผ้ากันเปื้อนแล้วตามเข้าครัวมาเลยจ้า",
      img :"https://img.wongnai.com/p/1600x0/2018/04/12/ea3958919b694b48a93cfe2d7bb18f13.jpg",
      price : "ราคา 50 บาท",
    },
    {
      id: 3,
      name: "มันทอดเชื่อม",
      detail: "วัตถุดิบ 1. มันม่วง 1 กิโลกรัม 2. น้ำมันสำหรับทอด 1 ลิตร 3. น้ำตาลปี๊บ 300 กรัม  4. เกลือ ½ ช้อนชา ",
      img :"https://img.wongnai.com/p/1600x0/2018/06/01/0cbc0d7ca248403cb56123b3c31eed33.jpg",
      price : "ราคา 60 บาท",
    },
    {
      id: 4,
      name: "ขนมต้ม",
      detail: "วิธีทำ STEP 1 : ทำแป้ง + ทำไส้  - นำแป้งข้าวเหนียวมาแบ่งเป็น 3 ถ้วยเท่า ๆ กัน (ถ้วยละ 100 กรัม)  - เทน้ำกระเจี๊ยบ น้ำอัญชัน และใบเตย ลงไปในแป้งข้าวเหนียวแต่ละถ้วย นวดให้เข้ากันจนกว่าแป้งไม่ติดมือ แล้วใช้พลาสติกแรปคลุมชามแป้งพักไว้ก่อน- นำกระทะขึ้นตั้งไฟปานกลาง ใส่น้ำตาลปี๊บ คนจนน้ำตาลปี๊บละลาย ใส่มะพร้าวขูด (สำหรับทำไส้) และเกลือป่นลงไป คนให้เข้ากัน เคี่ยวจนแห้ง และยกออกจากเตา อ่านต่อได้ที่ https://www.wongnai.com/recipes/ka-nom-tom?ref=ct",
      img :"https://img.wongnai.com/p/1600x0/2018/03/30/39feae07ae934c95853a6539f6e55e41.jpg",
      price : "ราคา 50 บาท",
    },
    {
      id: 5,
      name: "บัวลอยเสียบไม้",
      detail: "วัตถุดิบ แป้งข้าวเจ้า 1 ถ้วย แป้งข้าวเหนียว 1 ถ้วย มันม่วงบด 50 กรัม ฟักทองบด 50 กรัม  น้ำใบเตย 50 มิลลิลิตร น้ำเปล่า (แป้งมันม่วง) 50 มิลลิลิตร น้ำเปล่า (แป้งฟักทอง) 50 มิลลิลิตร หัวกะทิ 500 มิลลิลิตร น้ำตาลทราย ½ ถ้วย เกลือ ½ ช้อนชา งาขาว และงาดำ ตามชอบ น้ำตาลแดง ตามชอบ  อ่านต่อได้ที่ https://www.wongnai.com/recipes/bua-loy-stick?ref=ct",
      img :"https://img.wongnai.com/p/1600x0/2018/06/18/01a71d61f4a24bdf83c61d257be49dac.jpg",
      price : "ราคา 30 บาท",
    }
  ];
}


  loadAll(){
  return Promise.resolve(this.foodlist);
  }

  loadById(placeId:any){
  let place = this.foodlist.find( ({id}) => id===placeId );
    return Promise.resolve(place);
  }
  
  loadAllfastfoodlist(){
    return Promise.resolve(this.fastfoodlist);
  }
  loadfastfoodlistId(fastfoodlistId:any){
    let fastfood = this.fastfoodlist.find( ({id}) => id===fastfoodlistId);
    return Promise.resolve(fastfood);
  }

  loadAllDrink(){
    return Promise.resolve(this.drinklist);
  }
  loadDrinkById(drinkId:any){
    let drink = this.drinklist.find( ({id}) => id===drinkId );
    return Promise.resolve(drink);
  }

  loadAlldesert(){
    return Promise.resolve(this.desertlist);
  }
  loaddesertlistId(desertlistId:any){
    let desert = this.desertlist.find( ({id}) => id===desertlistId );
    return Promise.resolve(desert);
  }


}


